#include <bits/stdc++.h>
using namespace std;

int main()
{
    stack<int> s;				//声明一个存放int的栈,名字为s
    s.push(1);					//栈顶放入一个1，此时栈为[1],时间复杂度为O(1)
    s.push(2);					//栈顶放入一个2，此时栈为[1,2],时间复杂度为O(1)
    s.push(100);				//栈顶放入一个100，此时栈为[1,2,100],时间复杂度为O(1)
    cout << s.top() << '\n';	//top()返回栈顶元素，栈不改变，仍然为[1,2,100],时间复杂度为O(1)
    s.pop();					//弹出栈顶,此时栈为[1,2],时间复杂度为O(1),大家可以对比vector删除最后一个元素的复杂度
    cout << s.size() << '\n';	//返回栈中元素的个数,时间复杂度为O(1)
    cout << s.empty() << '\n';	//返回一个bool量表示栈是否为空
    
    //栈没有clear的方法,需要这样清空
    while(!s.empty())//只要栈不为空
        s.pop();//弹出栈顶元素
    //
    cout << s.size() << '\n';
    //栈不能用[]索引,s[1]这种写法是错误的！
    return 0;
}
